# Імпортуємо модуль "re" для роботи з регулярними виразами.
import re
# Імпортуємо "Callable" для вказівки типу аргументу-функції (для sum_profit).
from typing import Callable

# Визначаємо функцію-генератор, що приймає рядок тексту.
def generator_numbers(text: str):
    # Регулярний вираз для пошуку дійсних чисел (з крапкою) у тексті.
    # '\b' - межа слова, '\d+' - одна або більше цифр, '\.' - крапка.
    pattern = r'\b\d+\.\d+\b'

    # Знаходимо всі підрядки, що відповідають шаблону, і повертаємо їх як список рядків.
    numbers_as_strings = re.findall(pattern, text)

    # Перетворюємо знайдений рядок на дійсне число (float) та "повертаємо" його через 'yield', створюючи генератор.
    for number_str in numbers_as_strings:
        yield float(number_str)

# Визначаємо функцію для обчислення прибутку,яка приймає текст і функцію-генератор.
def sum_profit(text: str, func: Callable):
    # Викликаємо функцію з вхідним текстом.
    number_generator = func(text)

    # Підсумуємо всі елементи, які видає генератор.
    total_sum = sum(number_generator)

    # Повертаємо обчислену загальну суму.
    return total_sum

# Приклад 
text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."
# Обчислюємо загальний дохід
total_income = sum_profit(text, generator_numbers)
# Виводимо результат на екран.
print(f"Загальний дохід: {total_income}")